{
  "id": "http",
  "name": "HTTP and RESTful API design",
  "description": "The Hypertext Transfer Protocol, the transport layer of web application.",
  "headmaster": "erik.bakker@lunatech.com",
  "teachers": [ "muayad.ali@lunatech.com" ],
  "tags": [],
  "image": "/images/http.png",
  "topics": [
    {
      "id": "http1-basics",
      "name": "HTTP Basics",
      "description": "HTTP is the protocol between browsers or other clients and web applications. Designing web applications involves thinking about the requests that a client will make, and debugging often starts at looking at HTTP requests and responses. Understanding the structure of an HTTP request and response is vital. Dexterity with a tool to create requests and inspect responses is important for every web developer.",
      "tags": ["required-for-junior"],
      "resources": [],
      "abilities": [
        "Send requests with an arbitrary verb, arbitrary headers and a JSON body to a server",
        "Inspect the request and response that a web application makes in the browser",
        "Do a GET-request without headers using telnet"
      ],
      "assessment-questions": [
        { "question": "What are the four most common HTTP verbs?" },
        { "question": "What are the three components of an HTTP request? Which ones are optional?", "answer-hint": "Request-Line, headers (optional), body (optional)" },
        { "question": "What are the three components of an HTTP response? Which ones are optional?", "answer-hint": "Status-Line, headers (optional), body (optional)" },
        { "question": "What are two common encodings of request bodies?", "answer-hint": "E.g. application/json, application/x-www-form-urlencoded (default for an HTML form) or multipart/form-data" }
      ]
    },

    {
      "id": "common-statuscodes",
      "name": "Common Status Codes",
      "description": "HTTP statuscodes are standardized and grouped. Knowing the most common status codes and the grouping helps interpret and design restful APIs",
      "tags": ["required-for-junior"],
      "dependencies": ["http1-basics"],
      "resources": [{
        "name": "HTTP/1.1: Status Code Definitions",
        "type": "documentation",
        "url": "https://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html"}],
      "abilities": [
        "Decide on suitable response status codes for a RESTful API that you design."
      ],
      "assessment-questions": [
        { "question": "What's a 200 response?" },
        { "question": "What's a 403 response?" },
        { "question": "What's a 500 response?" },
        { "question": "What does a 3xx series response code imply?" },
        { "question": "What does a 4xx series response code imply?" },
        { "question": "What does a 5xx series response code imply?" },
        { "question": "You are making an API andpoint where a resource can be created. What's a suitable response-code if the creation succeeded?", "answer-hint": "201 Created. But 200 is probably also acceptable." },
        { "question": "You are making an API andpoint where a resource can be created. What's a suitable response-code if the creation failed because the client sent wrong JSON?", "answer-hint": "Client failure, so must be 4xx. Probably 400 Bad Request." },
        { "question": "You are making an API andpoint where a resource can be retrieved. What's a suitable response-code if the retrieval failed because the database is down?", "answer-hint": "Server failure, so must be 5xx. Probably 500 Internal Server Error, but 502 Bad Gateway or 503 Service Unavailable are also acceptable." }
      ]
    },

    {
      "id": "cli-tooling",
      "name": "Command Line tooling",
      "description": "Many tools exist to create and execute arbitrary HTTP requests. cURL and HTTPie are popular ones. They are very useful when experimenting with or debugging APIs",
      "tags": ["required-for-junior"],
      "dependencies": ["http1-basics"],
      "resources": [{
        "name": "HTTPie website",
        "type": "documentation",
        "url": "https://httpie.org/"
      }, {
        "name": "cURL website",
        "type": "documentation",
        "url": "https://curl.haxx.se/"
      }],
      "abilities": [
        "Inspect the response headers of a GET request to google.com",
        "Send a request with a JSON body and the appropriate Content-Type header to an API endpoint."
      ]
    },

    {
      "id": "tls",
      "name": "Transport Layer Security",
      "description": "Transport Layer security is the standard security layer on the web. Prohibitively computationally expensive in the past, it's now getting omnipresent. Java and Scala applications can use TLS, support is built into the standard library. Tools like Java's `keytool` or the friendlier GUI tool Keystore Explorer are essential in creating, inspecting and understanding keystores and trust stores. A good conceptual grasp of TLS, the handshake in TLS and mutual authentication are beneficial when connection issues need to be debugged.",
      "tags": [],
      "assessment-questions": [
        { "question": "What alternative could you think of in the absense of Transport Layer Security?", "answer-hint": "Application layer security for example" },
        { "question": "What does client authentication mean in the context of TLS?", "answer-hint": "It means that the client also uses a certificate to prove its identity to the server" },
        { "question": "What is a Certificate Authority? Why do they exist?", "answer-hint": "A certificate authority is a trusted party that signs certificates. They exist to avoid having to exchange certificates with every party that you want to communicate with." },
        { "question": "What's the difference between SSL and TLS?", "answer-hint": "SSL (Secure Sockets Layer) is very outdated. TLS is the successor, but colloquially still called SSL sometimes." },
        { "question": "How does HTTPS relate to TLS?", "answer-hint": "HTTPS is HTTP over a connection secured by TLS." },
        { "question": "What's the default port for an HTTPS server?", "answer-hint": "443" },
        { "question": "What's the normal procedure to obtain a CA-signed certificate?", "answer-hint": "Create a private key, create a Certificate Signing Request (CSR), submit the CSR to the CA which will verify your identity and supply you with the certificate." },
        { "question": "In a Java Key Store file, what's the difference between a PrivateKeyEntry and a TrustedCertEntry?", "answer-hint": "Private Key Entry contains a private key that you can use to prove your own identity, or to sign things. A Trusted Cert Entry is a certificate that you trust."}
      ],
      "abilities": [
        "Use the `keytool` command to inspect a JKS keystore.",
        "Use KeyStore Explorer to create self-signed certificates."
      ]
    },

    {
      "id": "browser-tooling",
      "name": "Browser Tooling",
      "description": "All modern browsers have advanced tooling for inspecting requests and responses between browser and server. They make visible the headers of requests and responses, their body content and how long requests take.",
      "tags": ["required-for-junior"],
      "assessment-questions": [],
      "dependencies": ["http1-basics"],
      "resources": [{
        "name": "Discover DevTools course on  Code School",
        "url": "https://www.codeschool.com/courses/discover-devtools",
        "type": "video"
      }],
      "abilities": [
        "Use the tooling in your preferred browser to inspect request headers",
        "Find the request that you are looking for on pages that do many requests",
        "Determine how many Ajax calls the frontpage of Amazon.com makes",
        "Use your browser to determine the response headers of the 302 response you get when you browse to http://google.com"
      ]
    },

    {
      "id": "restful-api-design",
      "name": "RESTful API design",
      "description": "REST is an architectural style for designing networked applications. It has been defined by Roy Fielding in his PhD dissertation, and has gained a lot of traction among software designers since. Today, it's the most commonly used pattern for designing API's, and it's almost exclusively used on HTTP, with JSON being most people's favourite representation.\n\nNot all parts of REST that Fielding described are commonly used, but many of the popular ideas did come from his paper. In RESTful API design we avoid an envelope with a status around the response body, instead we use the response code and headers that HTTP offers us. But REST is not a standard, there are many different ways of doing the details.\n\nA common format for specifying APIs is OpenAPI, also known as Swagger. A Swagger definition specifies what resources and API exposes, which endpoints, which methods are supported, which path, querystring or body parameters endpoints take. Also the structure of the request and response bodies and possible error responses are described. This is a very useful tool for designing an API. Many experienced API designers subscribe to the idea of 'design first': you design your API in Swagger first and have it validated by your consumers, before you build it.",
      "tags": ["required-for-junior"],
      "dependencies": [ "common-statuscodes" ],
      "assessment-questions": [
        { "question": "What does the abbreviation REST stand for?" },
        { "question": "What are a resource and a representation, and how do they relate?" },
        { "question": "What's the difference between PUT and PATCH?"},
        { "question": "Is a DELETE request idem-potent? And a POST request?" },
        { "question": "What's the Content-Type of a JSON response?" }
      ],
      "abilities": [
        "Design an API and create a Swagger specification for it."
      ]
    }
  ],

  "projects": [
    {
      "id": "",
      "name": "Designing a RESTful API for a Phonebook application",
      "dependencies": ["http1-basics", "common-statuscodes", "restful-api-design"],
      "description": "The goal of this project is to design a RESTful API for a phonebook application.\n\n# Requirements\n\nDesign an API for a phonebook application. The phonebook has one top-level resource, a `Contact`. A contact has a name and a type, which can have the value `Personal` or `Business`. Contacts can be created, updated and deleted. Contacts can also be listed, and the list can be filtered by type, and by partial name match.\n\nContacts have zero or more phone numbers. A phone number consists of a number and a type, which is one of 'Mobile' or 'Fixed'. Phone numbers can be added and removed from a Contact. The phone numbers of a Contact can be listed. The list can be filtered by phone number type.\n\nThere is no way to list all phonenumbers in the phonebook.\n\n# Deliverables\n\nAn OpenAPI specification of this API."
    }
  ]
}
